// Завдання 8:
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

function min(a, b) { //оголошення функції
        if (typeof a !== 'number' || typeof b !== 'number') {   // Перевірка, чи обидва аргументи є числами
        return 'Not a number!'; // Якщо ні, повертаємо рядок
    }
    return a < b ? a : b; // Повертаємо менше з двох чисел
}
console.log(min(5, 10)); // 5
console.log(min(5, '10')); // Not a number!