// Завдання 9:

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

function isAdult(age) { // оголошення функції
    if (age >= 18) { // Перевірка, чи вік користувача більше або дорівнює 18
        return true; // Якщо так, повертаємо true
    }
    else { // Якщо ні, запитуємо підтвердження
        return confirm("Вам вже 18 років?"); // Повертаємо результат confirm (true або false)
    }
}
console.log(isAdult(20)); // true
console.log(isAdult(16)); // Запит підтвердження, результат буде true або false в залежності від відповіді користувача