// Завдання 7:

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
function getNumbers(min, max) { // Функція для отримання чисел від max до min
    let sum = 0; // Змінна для зберігання суми парних чисел
    // Цикл для виведення чисел від max до min
    
    for (let i = max; i >= min; i--) { // Починаємо з max і йдемо до min
        console.log(i); // Виводимо число в консоль
        // Перевіряємо, чи число парне
        if (i % 2 === 0) {  // Якщо число парне
            // Додаємо його до суми 
        sum += i; // Додаємо парне число до суми
        }
    }
        return sum; // Повертаємо суму парних чисел
}
console.log(getNumbers(5, 15)); // Приклад виклику функції