// Завдання 1:
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

let number = prompt("Введіть число:"); // Запитуємо у користувача число
number = Number (number); // Перетворюємо введене значення на число
if (number === 10) { // Перевіряємо, чи дорівнює число 10
    alert ("Вірно"); // Якщо число дорівнює 10, виводимо 'Вірно'
}
else {
    alert ("Невірно"); // Якщо число не дорівнює 10, виводимо 'Невірно'
}
console.log(number); // Для перевірки, що введено

